#+TITLE: VRP solver environment
#+AUTHOR: Fernando Rodriguez Flores
#+AUTHOR: Rodrigo Garcia Gomez
#+AUTHOR: Heidy Abreu Fumero

**** tests

     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
       (progn (defparameter c1 (basic-cvrp-client 1 1))
	      (defparameter c2 (basic-cvrp-client 2 1))
	      (defparameter c3 (basic-cvrp-client 3 4))
	      (defparameter c4 (basic-cvrp-client 4 3))
	      (defparameter c5 (basic-cvrp-client 5 2))
	      (defparameter c6 (basic-cvrp-client 6 1))

	      (defparameter v1 (cvrp-vehicle 1 20))
	      (defparameter v2 (cvrp-vehicle 2 20))

	      (defparameter d0 (basic-depot))

	      ;; Solution for the eval-graph
	      ;; remember to start and end all the routes with depot
	      ;; the starting depot is placed in the previous-client slot
	      (defparameter r1 (route-for-simulation :id 1 :vehicle v1 :depot d0
						     :clients (list c1 c2 c3 (clone d0)) :previous-client (clone d0)))
	      (defparameter r2 (route-for-simulation :id 2 :vehicle v2 :depot d0
						     :clients (list c4 c5 c6 (clone d0)) :previous-client (clone d0)))

	      (defparameter s1 (basic-solution :id 1 :routes (list r1 r2)))

	      ;; Solution for the neighborhood-tree
	      ;; In this case we use normal routes without depots
	      (defparameter r1-t (basic-route :id 1 :vehicle v1 :depot d0
					      :clients (list c1 c2 c3)))
	      (defparameter r2-t (basic-route :id 2 :vehicle v2 :depot d0
					      :clients (list c4 c5 c6)))

	      (defparameter s1-t (basic-solution :id 1 :routes (list r1-t r2-t)))


	      (defparameter dist-mat #2A((0 1 2 3 4 5 6)
					 (1 0 20 2 1 3 2)
					 (2 20 0 2 2 2 2)
					 (3 2 2 0 1 2 1)
					 (4 1 2 1 0 2 3)
					 (5 3 2 2 2 0 1)
					 (6 2 2 1 3 1 0)))
	      (defparameter problem (finite-fleet-cvrp-problem :id 1 :clients (list c1 c2 c3 c4 c5 c6)
							       :depot d0 :distance-matrix dist-mat :fleet (list v1 v2) ))

	      (defparameter graph (init-graph s1)))

       (let* ((best-solution-found nil))

	 (bformat t "Testing exhaustive/best-improvement rab with delta-cost* and generator.")

	 ;; let's evaluate the solution

	 (progn
	   (def-var total-distance 0 graph)
	   (loop for r in (routes s1) do 
	     (progn
	       (def-var route-distance 0 graph)
	       (def-var route-demand (capacity (vehicle r)) graph) 
	       (loop for c in (clients r) do 
		 (progn
		   (increment-distance (previous-client r) c route-distance dist-mat graph)
		   (decrement-demand c route-demand graph) 
		   (setf (previous-client r) c)))
	       (increment-value total-distance route-distance graph)
	       (apply-penalty route-demand total-distance 10 graph)) 
	     (return-value total-distance graph)))

	 (format t "initial cost: ~a~%" (output-value (output graph)))
	 (format t "initial solution: ~a~%" (solution-track graph))


	 (format t "~%Testing exhaustive rab...~%")

	 ;;{{{ let's explore the neighborhood rarb
	 (setf best-solution-found
	       (rab-exhaustive-best-with-generator s1-t problem graph))
	 ;;}}}


	 (if best-solution-found
	     (then
	       (format t "------------------~%Best neighbor:~%")
	       (format t "~a" best-solution-found)
	       (format t "with cost ~a ~%" (cost best-solution-found))
	       (format t "------------------~%")
	       )
	     (else
	       (format t "No better solution found in neighbor.~%")))))
#+END_SRC

#+RESULTS:
#+begin_example
=========================================================================
 Testing exhaustive/best-improvement rab with delta-cost* and generator.
=========================================================================

initial cost: 39
initial solution: S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>


Testing exhaustive rab...

With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 1 0> <op:b 1 1 0>) 


With cost 40:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c2: 1> <c1: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 1 0> <op:b 1 2 0>) 


With cost 20:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c2: 1> <c3: 4> <c1: 1> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 1 0> <op:b 1 3 0>) 

----> found better cost <---- 


With cost 40:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c2: 1> <c1: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 2 0> <op:b 1 1 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 2 0> <op:b 1 2 0>) 


With cost 20:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c3: 4> <c2: 1> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 2 0> <op:b 1 3 0>) 


With cost 40:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c3: 4> <c1: 1> <c2: 1> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 3 0> <op:b 1 1 0>) 


With cost 20:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c3: 4> <c2: 1> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 3 0> <op:b 1 2 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 3 0> <op:b 1 3 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 2 1 0> <op:b 2 1 0>) 


With cost 42:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c5: 2> <c4: 3> <c6: 1> <d:0>))>
operations: (<op:a 2 1 0> <op:b 2 2 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c5: 2> <c6: 1> <c4: 3> <d:0>))>
operations: (<op:a 2 1 0> <op:b 2 3 0>) 


With cost 42:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c5: 2> <c4: 3> <c6: 1> <d:0>))>
operations: (<op:a 2 2 0> <op:b 2 1 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 2 2 0> <op:b 2 2 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c6: 1> <c5: 2> <d:0>))>
operations: (<op:a 2 2 0> <op:b 2 3 0>) 


With cost 42:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c6: 1> <c4: 3> <c5: 2> <d:0>))>
operations: (<op:a 2 3 0> <op:b 2 1 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c6: 1> <c5: 2> <d:0>))>
operations: (<op:a 2 3 0> <op:b 2 2 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 2 3 0> <op:b 2 3 0>) 

------------------
Best neighbor:
S1: (20)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c2: 1> <c3: 4> <c1: 1> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
with cost 20 
------------------
#+end_example

**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
       (progn (defparameter c1 (basic-cvrp-client 1 1))
	      (defparameter c2 (basic-cvrp-client 2 1))
	      (defparameter c3 (basic-cvrp-client 3 4))
	      (defparameter c4 (basic-cvrp-client 4 3))
	      (defparameter c5 (basic-cvrp-client 5 2))
	      (defparameter c6 (basic-cvrp-client 6 1))

	      (defparameter v1 (cvrp-vehicle 1 20))
	      (defparameter v2 (cvrp-vehicle 2 20))

	      (defparameter d0 (basic-depot))

	      ;; Solution for the eval-graph
	      ;; remember to start and end all the routes with depot
	      ;; the starting depot is placed in the previous-client slot
	      (defparameter r1 (route-for-simulation :id 1 :vehicle v1 :depot d0
						     :clients (list c1 c2 c3 (clone d0)) :previous-client (clone d0)))
	      (defparameter r2 (route-for-simulation :id 2 :vehicle v2 :depot d0
						     :clients (list c4 c5 c6 (clone d0)) :previous-client (clone d0)))

	      (defparameter s1 (basic-solution :id 1 :routes (list r1 r2)))

	      ;; Solution for the neighborhood-tree
	      ;; In this case we use normal routes without depots
	      (defparameter r1-t (basic-route :id 1 :vehicle v1 :depot d0
					      :clients (list c1 c2 c3)))
	      (defparameter r2-t (basic-route :id 2 :vehicle v2 :depot d0
					      :clients (list c4 c5 c6)))

	      (defparameter s1-t (basic-solution :id 1 :routes (list r1-t r2-t)))


	      (defparameter dist-mat #2A((0 1 2 3 4 5 6)
					 (1 0 20 2 1 3 2)
					 (2 20 0 2 2 2 2)
					 (3 2 2 0 1 2 1)
					 (4 1 2 1 0 2 3)
					 (5 3 2 2 2 0 1)
					 (6 2 2 1 3 1 0)))
	      (defparameter problem (finite-fleet-cvrp-problem :id 1 :clients (list c1 c2 c3 c4 c5 c6)
							       :depot d0 :distance-matrix dist-mat :fleet (list v1 v2) ))

	      (defparameter graph (init-graph s1)))

       (let* ((best-solution-found nil))

	 (bformat t "Testing exhaustive/best-improvement rab with delta-cost* and generator.")

	 ;; let's evaluate the solution

	 (progn
	   (def-var total-distance 0 graph)
	   (loop for r in (routes s1) do 
	     (progn
	       (def-var route-distance 0 graph)
	       (def-var route-demand (capacity (vehicle r)) graph) 
	       (loop for c in (clients r) do 
		 (progn
		   (increment-distance (previous-client r) c route-distance dist-mat graph)
		   (decrement-demand c route-demand graph) 
		   (setf (previous-client r) c)))
	       (increment-value total-distance route-distance graph)
	       (apply-penalty route-demand total-distance 10 graph)) 
	     (return-value total-distance graph)))

	 (format t "initial cost: ~a~%" (output-value (output graph)))
	 (format t "initial solution: ~a~%" (solution-track graph))


	 (format t "~%Testing exhaustive rab...~%")

	 ;;{{{ let's explore the neighborhood rarb
	 (setf best-solution-found
	       (rab-random-best-with-generator s1-t problem graph))
	 ;;}}}


	 (if best-solution-found
	     (then
	       (format t "------------------~%Best neighbor:~%")
	       (format t "~a" (solution-track graph))
	       (format t "with cost ~a ~%" (output-value (output graph)))
	       (format t "------------------~%")
	       )
	     (else
	       (format t "No better solution found in neighbor.~%")))))
#+END_SRC

#+RESULTS:
#+begin_example
=========================================================================
 Testing exhaustive/best-improvement rab with delta-cost* and generator.
=========================================================================

initial cost: 39
initial solution: S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>


Testing exhaustive rab...

With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 2 0> <op:b 1 2 0>) 


With cost 40:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c2: 1> <c1: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 1 0> <op:b 1 2 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 2 0> <op:b 1 2 0>) 


With cost 40:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c2: 1> <c1: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 2 0> <op:b 1 1 0>) 


With cost 39:
 S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>
operations: (<op:a 1 2 0> <op:b 1 2 0>) 

No better solution found in neighbor.
#+end_example

*** exhaustive/best-improvement for rab with eval-graph and generator

     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
       (progn (defparameter c1 (basic-cvrp-client 1 1))
	      (defparameter c2 (basic-cvrp-client 2 1))
	      (defparameter c3 (basic-cvrp-client 3 4))
	      (defparameter c4 (basic-cvrp-client 4 3))
	      (defparameter c5 (basic-cvrp-client 5 2))
	      (defparameter c6 (basic-cvrp-client 6 1))

	      (defparameter v1 (cvrp-vehicle 1 20))
	      (defparameter v2 (cvrp-vehicle 2 20))

	      (defparameter d0 (basic-depot))

	      ;; Solution for the eval-graph
	      ;; remember to start and end all the routes with depot
	      ;; the starting depot is placed in the previous-client slot
	      (defparameter r1 (route-for-simulation 
				:id 1
				:vehicle v1 
				:depot d0
				:clients (list c1 c2 c3 (clone d0))
				:previous-client (clone d0)))
	      (defparameter r2 (route-for-simulation 
				:id 2 
				:vehicle v2
				:depot d0
				:clients (list c4 c5 c6 (clone d0))
				:previous-client (clone d0)))

	      (defparameter s1 (basic-solution
				:id 1 
				:routes (list r1 r2)))

	      (defparameter dist-mat #2A((0 1 2 3 4 5 6)
					 (1 0 20 2 1 3 2)
					 (2 20 0 2 2 2 2)
					 (3 2 2 0 1 2 1)
					 (4 1 2 1 0 2 3)
					 (5 3 2 2 2 0 1)
					 (6 2 2 1 3 1 0)))
	      (defparameter problem (finite-fleet-cvrp-problem :id 1 
							       :clients (list c1 c2 c3 c4 c5 c6)
							       :depot d0 
							       :distance-matrix dist-mat 
							       :fleet (list v1 v2) ))

	      (defparameter graph (init-graph s1)))

       (let* ((best-solution-found nil))

	 (bformat t "Testing exhaustive/best-improvement rab with delta-cost* and generator.")

	 ;; let's evaluate the solution

	 (progn
	   (def-var total-distance 0 graph)
	   (loop for r in (routes s1) do 
		(progn
		  (def-var route-distance 0 graph)
		  (def-var route-demand (capacity (vehicle r)) graph) 
		  (loop for c in (clients r) do 
		       (progn
			 (increment-distance (previous-client r) c route-distance dist-mat graph)
			 (decrement-demand c route-demand graph) 
			 (setf (previous-client r) c)))
		  (increment-value total-distance route-distance graph)
		  (apply-penalty route-demand total-distance 10 graph)) 
		(return-value total-distance graph)))

	 (format t "initial cost: ~a~%" (output-value (output graph)))
	 (format t "initial solution: ~a~%" (solution-track graph))

	 (setf bp1 (basic-strategy-blueprint))

	 ;; let's populate the blueprint
	 (prepare-blueprint-for-code-generation
	  `((select-route r1)
	    (select-client c1 from r1)
	    (select-route r2)
	    (select-client c2 from r2)
	    (swap-clients c1 c2))
	  +exhaustive-search-strategy+
	  +best-improvement+
	  bp1)

	 (format t "the generated code:~%~a~%"
		 (write-neighborhood-exploration-code bp1)))



       (progn ;; for rarac

	 (setf rarb (make-neighborhood-criterion 
		     `((select-route r1)
		       (select-client c1 from r1)
		       (select-route r2)
		       (select-client c2 from r2)
		       (swap-clients c1 c2))
		     +exhaustive-search-strategy+ 
		     +best-improvement+))



	 ;; (setf rarb (make-neighborhood-exploration-function bp))
	 ;; let's get the best neighbor
	 (setf best-neighbor (funcall rarb (neigh-tree-solution (solution-track graph)) 
				      problem
				      graph))

	 (if best-neighbor
	     (then
	      (format t "After rarb we found...~%")
	      (format t "With cost ~a...~%" (cost best-neighbor))
	      (pp-solution best-neighbor t))
	     (else
	      (format t "No best neighbor found :-[."))))

       ))

#+END_SRC

#+RESULTS:
#+begin_example
=========================================================================
 Testing exhaustive/best-improvement rab with delta-cost* and generator.
=========================================================================

initial cost: 39
initial solution: S1: (0)
routes:
  <r1: <cv:1. 0/20> (<d:0>: (<c1: 1> <c2: 1> <c3: 4> <d:0>))>
  <r2: <cv:2. 0/20> (<d:0>: (<c4: 3> <c5: 2> <c6: 1> <d:0>))>

the generated code:
(LAMBDA (SOLUTION PROBLEM GRAPH &OPTIONAL (INITIAL-BEST-COST 0))
  (DECLARE (IGNORABLE INITIAL-BEST-COST SOLUTION PROBLEM GRAPH))
  (LET* ((EXPL-TYPE 'EXHAUSTIVE-EXPLORATION)
         (CODE
          '((SELECT-ROUTE R1) (SELECT-CLIENT C1 FROM R1) (SELECT-ROUTE R2)
            (SELECT-CLIENT C2 FROM R2) (SWAP-CLIENTS C1 C2)))
         (*VRP-STOP-NEIGHBORHOOD-SEARCH* NIL)
         (OPS-LIST NIL)
         (NEIGH-TREE (BUILD-NEIGHBORHOOD-TREE CODE SOLUTION))
         (SOL-GENERATOR (FUNCALL EXPL-TYPE NEIGH-TREE))
         (CURRENT-SOLUTION (FUNCALL SOL-GENERATOR))
         (CURRENT-COST (OUTPUT-VALUE (OUTPUT GRAPH)))
         (BEST-NEIGHBOR NIL)
         (BEST-COST CURRENT-COST)
         (BEST-NEIGHBOR-AS-SOLUTION NIL))
    (LOOP WHILE CURRENT-SOLUTION
          DO (SETF OPS-LIST
                     (FROM-COORDINATES-TO-OPERATIONS
                      CURRENT-SOLUTION)) (DO-SUITE-OPERATIONS GRAPH
                                                              OPS-LIST) (SETF CURRENT-COST
                                                                                (OUTPUT-VALUE
                                                                                 (OUTPUT
                                                                                  GRAPH))) (UNDO-SUITE-OPERATIONS
                                                                                            GRAPH
                                                                                            OPS-LIST) (SETF CURRENT-SOLUTION
                                                                                                              (FUNCALL
                                                                                                               SOL-GENERATOR)) (IF (<
                                                                                                                                    CURRENT-COST
                                                                                                                                    BEST-COST)
                                                                                                                                   (THEN
                                                                                                                                     (SETF BEST-NEIGHBOR
                                                                                                                                             (CLONE
                                                                                                                                              OPS-LIST))
                                                                                                                                     (SETF BEST-COST
                                                                                                                                             CURRENT-COST))))
    (IF BEST-NEIGHBOR
        (THEN
          (DO-SUITE-OPERATIONS GRAPH BEST-NEIGHBOR)
          (SETF BEST-NEIGHBOR-AS-SOLUTION
                  (NEIGH-TREE-SOLUTION (SOLUTION-TRACK GRAPH)))
          (SETF (COST BEST-NEIGHBOR-AS-SOLUTION) BEST-COST)))
    (VALUES BEST-NEIGHBOR-AS-SOLUTION)))
After rarb we found...
With cost 17...
S1:
    R1: (1, 4, 3)
    R2: (2, 5, 6)
#+end_example






